# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0

  - [-1, 1, GhostConv, [32, 3, 2]] # 1-P1/2
  - [-1, 1, GhostConv, [64, 3, 2]] # 2-P2/4
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, GhostConv, [128, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, GhostConv, [256, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, GhostConv, [512, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]] # 10

  - [0, 1, CBRM, [32]] # 11-P2/4
  - [-1, 1, Shuffle_Block, [128, 2]] # 12-P3/8
  - [-1, 3, Shuffle_Block, [128, 1]] # 13
  - [-1, 1, Shuffle_Block, [256, 2]] # 14-P4/16
  - [-1, 7, Shuffle_Block, [256, 1]] # 15
  - [-1, 1, Shuffle_Block, [512, 2]] # 16-P5/32
  - [-1, 3, Shuffle_Block, [512, 1]] # 17

# YOLOv8.0n head
head:
  - [[5, 13], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 19 (P3/8-small)
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 21, Y5, lateral_convs.0

  - [[6, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [256]] # 23 (P4/16-medium)

  - [[10, 17], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [256]] # 25 (P5/32-large)

  - [[21, 23, 25], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
