# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0

  - [-1, 1, PatchEmbed, [96, 4]] # 1 [b, 96, 160, 160]
  - [-1, 1, SwinStage, [96, 2, 3, 7]] # 2 [b, 96, 160, 160]
  - [-1, 1, PatchMerging, [192]] # 3 [b, 192, 80, 80]
  - [-1, 1, SwinStage, [192, 2, 6, 7]] # 4 --F0-- [b, 192, 80, 80] p3
  - [-1, 1, PatchMerging, [384]] # 5 [b, 384, 40, 40]
  - [-1, 1, SwinStage, [384, 6, 12, 7]] # 6 --F1-- [b, 384, 40, 40] p4
  - [-1, 1, PatchMerging, [768]] # 7 [b, 768, 20, 20]
  - [-1, 1, SwinStage, [768, 2, 24, 7]] # 8 --F2-- [b, 768, 20, 20]
  - [-1, 1, SPPF, [768, 5]]

  - [0, 1, CBRM, [32]] # 10-P2/4
  - [-1, 1, Shuffle_Block, [128, 2]] # 11-P3/8
  - [-1, 3, Shuffle_Block, [128, 1]] # 12
  - [-1, 1, Shuffle_Block, [256, 2]] # 13-P4/16
  - [-1, 7, Shuffle_Block, [256, 1]] # 14
  - [-1, 1, Shuffle_Block, [512, 2]] # 15-P5/32
  - [-1, 3, Shuffle_Block, [512, 1]] # 16

head:
  - [[4, 12], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 18 (P3/8-small)
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 20, Y5, lateral_convs.0

  - [[6, 14], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [256]] # 22 (P4/16-medium)

  - [[9, 16], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [256]] # 24 (P5/32-large)

  - [[20, 22, 24], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
